---
type: HorizontalCurveEndpoint
namespace: Autodesk.Revit.DB.Infrastructure
version: 2024
members: 3
tags: [revit-api, class]
---

# HorizontalCurveEndpoint

`Autodesk.Revit.DB.Infrastructure.HorizontalCurveEndpoint` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | NextCurveType | 2021.1 | `public HorizontalCurveType NextCurveType { get ; internal set ; }` |
| Property | PreviousCurveType | 2021.1 | `public HorizontalCurveType PreviousCurveType { get ; internal set ; }` |
| Property | Station | 2021.1 | `public double Station { get ; internal set ; }` |